app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"  ORDER BY release_date
---
    def index
      @style_title = false
      @style_release = false

      # @movies = Movie.all

      what_to_order_by = params[:sort_by]


      if what_to_order_by == "title"
        # @movies = @movies.order("title")
        session[:sort_by] = "title"
        # @style_title = true

      elsif what_to_order_by == "release_date"
        # @movies = @movies.order("release_date")
        session[:sort_by] = "release_date"
        # @style_release = true
      end

      @movies = Movie.all